import * as React from 'react'
import { Navbar, Button, Link } from '@nextui-org/react'
import {
  advantagesId,
  firstSectionId,
  partnerId,
  roadmapId,
} from '../../src/constants'

const collapseItems = [
  {
    title: '首页',
    href: firstSectionId,
  },
  {
    title: '特色',
    href: advantagesId,
  },
  {
    title: '开发路线',
    href: roadmapId,
  },
  {
    title: '合作伙伴',
    href: partnerId,
  },
  {
    title: '社区',
    href: '#',
  },
]

function AppBar() {
  return (
    <Navbar
      css={{
        position: 'fixed',
        top: 0,
      }}
      maxWidth="fluid"
      disableShadow
      variant="static"
    >
      <Navbar.Brand>
        <Navbar.Toggle
          css={{
            marginRight: '10px',
          }}
          showIn="xs"
          aria-label="toggle navigation"
        />
        <svg
          width="134"
          height="26"
          viewBox="0 0 134 26"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M12.0533 20V16H4.26667V12.3733H11.3067V8.66667H4.26667V5.06667H12.0267V1.09333H0.0533336V20H12.0533ZM20.1869 2.88H16.5602V4.58667C16.5602 5.81333 15.8935 6.74667 14.5069 6.74667H13.8402V10.2933H16.1869V15.9733C16.1869 18.6133 17.8669 20.24 20.6135 20.24C21.8935 20.24 22.5602 19.9467 22.7202 19.8667V16.5067C22.4802 16.56 22.0802 16.64 21.6535 16.64C20.7735 16.64 20.1869 16.3467 20.1869 15.2533V10.2933H22.7735V6.74667H20.1869V2.88ZM28.5565 11.7867C28.6365 10.8 29.4898 9.54667 31.1965 9.54667C33.1165 9.54667 33.8098 10.7733 33.8631 11.7867H28.5565ZM34.1565 15.2267C33.7831 16.2667 32.9565 16.96 31.4898 16.96C29.9165 16.96 28.5565 15.8933 28.4765 14.4H37.7031C37.7298 14.32 37.7831 13.7067 37.7831 13.1467C37.7831 8.88 35.2498 6.34667 31.1431 6.34667C27.7031 6.34667 24.5298 9.06667 24.5298 13.3333C24.5298 17.7867 27.7831 20.4 31.4365 20.4C34.7965 20.4 36.9031 18.48 37.5431 16.1867L34.1565 15.2267ZM48.8123 6.74667C48.5456 6.66667 48.1456 6.61333 47.7456 6.61333C46.679 6.61333 44.999 7.04 44.3056 8.53333V6.74667H40.3856V20H44.439V14.2133C44.439 11.5733 45.9056 10.6133 47.5323 10.6133C47.9323 10.6133 48.359 10.64 48.8123 10.7467V6.74667ZM55.3244 12.4C55.3244 11.0667 56.1777 10.08 57.511 10.08C58.9777 10.08 59.671 11.0667 59.671 12.3733V20H63.7244V11.68C63.7244 8.77333 62.231 6.4 58.8977 6.4C57.5377 6.4 55.911 7.01333 55.191 8.26667V6.74667H51.271V20H55.3244V12.4ZM71.1838 20V6.74667H67.1304V20H71.1838ZM66.7838 2.69333C66.7838 4 67.8504 5.06667 69.1304 5.06667C70.4638 5.06667 71.5304 4 71.5304 2.69333C71.5304 1.38667 70.4638 0.319998 69.1304 0.319998C67.8504 0.319998 66.7838 1.38667 66.7838 2.69333ZM79.5879 2.88H75.9613V4.58667C75.9613 5.81333 75.2946 6.74667 73.9079 6.74667H73.2413V10.2933H75.5879V15.9733C75.5879 18.6133 77.2679 20.24 80.0146 20.24C81.2946 20.24 81.9613 19.9467 82.1213 19.8667V16.5067C81.8813 16.56 81.4813 16.64 81.0546 16.64C80.1746 16.64 79.5879 16.3467 79.5879 15.2533V10.2933H82.1746V6.74667H79.5879V2.88ZM90.6117 25.0933L98.7717 6.74667H94.4783L91.545 13.84L88.3183 6.74667H83.785L89.3583 18.2133L86.345 25.0933H90.6117ZM122.486 20H127.072L120.032 1.09333H115.152L108.032 20H112.459L113.819 16.16H121.126L122.486 20ZM117.526 5.78666L119.792 12.32H115.206L117.526 5.78666ZM133.669 20V1.09333H129.402V20H133.669Z"
            fill="white"
          />
          <path
            d="M100.668 17.4933C100.668 18.96 101.895 20.24 103.388 20.24C104.882 20.24 106.135 18.96 106.135 17.4933C106.135 16 104.882 14.7733 103.388 14.7733C101.895 14.7733 100.668 16 100.668 17.4933Z"
            fill="#FF0000"
          />
        </svg>
      </Navbar.Brand>
      <Navbar.Content enableCursorHighlight hideIn="xs" variant="default">
        {collapseItems.map((item) => (
          <Navbar.Link as={Link} key={item.title} href={`#${item.href}`}>
            {item.title}
          </Navbar.Link>
        ))}
      </Navbar.Content>
      <Navbar.Content>
        <Navbar.Item>
          <Button auto as={Link} href="#" color="primary">
            Connect Wallet
          </Button>
        </Navbar.Item>
      </Navbar.Content>
      <Navbar.Collapse>
        {collapseItems.map((item) => (
          <Navbar.CollapseItem key={item.title}>
            <Link
              color="inherit"
              css={{
                minWidth: '100%',
              }}
              href={`#${item.href}`}
            >
              {item.title}
            </Link>
          </Navbar.CollapseItem>
        ))}
      </Navbar.Collapse>
    </Navbar>
  )
}

export default AppBar
